---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange.BoltDiameter
source: html/a7394128-92ff-eebd-46f4-b7f623d09991.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionISlopedFlange.BoltDiameter Property

Maximum bolt hole diameter, in. (mm)

## Syntax (C#)
```csharp
public double BoltDiameter { get; set; }
```